pathfinder/runtime/xrpc/demo/req1.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xrpc="http://monetdb.cwi.nl/XQuery" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://monetdb.cwi.nl/XQuery http://monetdb.cwi.nl/XQuery/XRPC.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema"><env:Header>  <wscoor:CoordinationContext xmlns:wscoor="http://docs.oasis-open.org/ws-tx/wscoor/2006/06" env:mustUnderstand="true">    <wscoor:Identifier>localhost:50001|663|453</wscoor:Identifier>    <wscoor:Expires>0</wscoor:Expires>    <wscoor:CoordinationType>http://docs.oasis-open.org/ws-tx/wsat/2006/06</wscoor:CoordinationType>  </wscoor:CoordinationContext></env:Header><env:Body><xrpc:request xrpc:module="xrpcdemo-functions" xrpc:location="http://localhost:50001/demo/demo-mod.xq" xrpc:method="add" xrpc:mode="none-trace" xrpc:arity="2"><xrpc:call><xrpc:sequence><xrpc:atomic-value xsi:type="xs:integer">1</xrpc:atomic-value></xrpc:sequence><xrpc:sequence><xrpc:atomic-value xsi:type="xs:integer">2</xrpc:atomic-value></xrpc:sequence></xrpc:call></xrpc:request></env:Body></env:Envelope>